<a href="https://colab.research.google.com/github/Evianitary18/Programming-With-Python/blob/main/Mini_Case_Cluster_Analysis_for_Student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Study Mini Case
## Modul 4 Live 7
### Clustering Analysis

Pada mini study case ini, kamu diminta untuk melakukan modeling pada case unsupervised learning. Kamu diminta untuk melakukan cluster analysis pada data `Mall_Customers.csv` untuk menentukan customer behaviour / customer propensity. Gunakan algoritma K-Means Clustering dan evaluasi jumlah hasil cluster nya menggunakan Elbow Method. Good Luck!

# K-Means Clustering

## Import Dataset

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

(200, 5)

## Data Preparation

### Using the Elbow Method to Find the Optimal Number of Clusters

## Remodeling using all data and the decided number of clusters.

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)  Cluster
0           1    Male   19                  15                      39        3
1           2    Male   21                  15                      81        0
2           3  Female   20                  16                       6        3
3           4  Female   23                  16                      77        0
4           5  Female   31                  17                      40        3

### Visualize the Clusters